[
    {
        "title": "Tom Dunn's Buns",
        "author": "",
        "authors": [],
        "journalists": [],
        "published_date": "2023-11-16 09:44:57",
        "published_date_precision": "full",
        "updated_date": null,
        "updated_date_precision": null,
        "parse_date": "2023-11-16 10:05:24",
        "link": "https://www.bathrugby.com/content/tom-dunns-buns",
        "domain_url": "bathrugby.com",
        "full_domain_url": "bathrugby.com",
        "name_source": "Bath Rugby",
        "is_headline": false,
        "paid_content": false,
        "parent_url": "https://www.bathrugby.com/content",
        "country": "GB",
        "rights": "bathrugby.com",
        "rank": 246195,
        "media": "https://media-cdn.incrowdsports.com/89aa59aa-712d-40a7-bc5a-845ee6c63ccd.png",
        "language": "en",
        "description": "Watch out Mary Berry, our very own star baker Tom Dunn surprised guests at Sally Lunn's Teahouse this week to put his spin on the world-famous Sally Lunn's bun.",
        "content": "This feature (Youtube) is currently not available because you need to provide consent to functional cookies. Please update your\ncookie preferences",
        "word_count": 21,
        "is_opinion": false,
        "twitter_account": null,
        "all_links": [
            "https://www.linkedin.com/company/bath-rugby/",
            "https://www.bathrugbyfoundation.com/",
            "https://www.farleigh.house/",
            "https://twitter.com/bathrugby",
            "https://www.instagram.com/bathrugby/",
            "https://www.dyson.co.uk/en",
            "https://www.tiktok.com/@bathrugby",
            "https://www.bathrugbyfoundation.com",
            "https://www.eticketing.co.uk/bathrugby/Events#_ga=2.94928021.841425356.1652445233-625367726.1630488202",
            "https://bathrugbyshop.com/?utm_source=Bath+Rugby+website&utm_medium=Website&utm_id=Navigation",
            "https://www.facebook.com/bathrugby"
        ],
        "all_domain_links": [
            "bathrugbyfoundation.com",
            "eticketing.co.uk",
            "facebook.com",
            "twitter.com",
            "tiktok.com",
            "bathrugbyshop.com",
            "linkedin.com",
            "farleigh.house",
            "instagram.com",
            "dyson.co.uk"
        ],
        "id": "7104cc4981422545270376249a194137",
        "score": 23.360588
    },
    {
        "title": "‘Like we're living in a movie!' – F1 drivers share their excitement ahead of ‘spectacular' Las Vegas Grand Prix",
        "author": "",
        "authors": [],
        "journalists": [],
        "published_date": "2023-11-16 08:12:31",
        "published_date_precision": "full",
        "updated_date": "2023-11-16 08:15:19",
        "updated_date_precision": "full",
        "parse_date": "2023-11-16 08:40:36",
        "link": "https://www.formula1.com/en/latest/article.like-were-living-in-a-movie-f1-drivers-share-their-excitement-ahead-of.4NjcQqsouY3KCW0Vy9TwVc.html",
        "domain_url": "formula1.com",
        "full_domain_url": "formula1.com",
        "name_source": "Formula 1",
        "is_headline": false,
        "paid_content": false,
        "parent_url": "https://www.formula1.com/en",
        "country": "CA",
        "rights": "formula1.com",
        "rank": 2486,
        "media": "https://media.formula1.com/image/upload/t_16by9North/f_auto/q_auto/v1700122545/fom-website/2023/Las%20Vegas/GettyImages-1784927557.jpg.transform/6col-retina/image.jpg",
        "language": "en",
        "description": "With the inaugural Las Vegas Grand Prix weekend having kicked off in exciting fashion, several of the drivers have been giving their reactions to the new event.",
        "content": "With the inaugural Las Vegas Grand Prix weekend having kicked off in exciting fashion, the F1 drivers have been giving their reactions to the new event.\nThe action began with a star-studded opening ceremony on Wednesday, which featured a host of big-name performers as well as appearances from all of the drivers.\nWhile the racing will not get under way until Free Practice 1 takes place on Thursday evening, anticipation is already building for the event, with Daniel Ricciardo among those to voice his enthusiasm for racing in the entertainment capital of the world.\n'It's cool, it's always cool, of course. I think being in Vegas sober is already unique!' Ricciardo joked when speaking to the media on Wednesday. 'Obviously that clip circulated of me mentioning it [would be cool] I think in 2017 – I said it but a lot of people put in a lot of work to make this happen, I did nothing! But knowing that we're here six years later, and we're not somewhere in the outskirts of Vegas, we are on the Strip… I don't know, it's definitely surreal.\n'I feel like we're living in a movie. Put it this way, I'm very glad that I'm here to experience this for the first time. Obviously I thought I'd have the whole year off racing, but it was half a year and I'm glad that I'm here for the first one. I think it's going to be pretty special.'\nCharles Leclerc – who recently revealed that he had partied with Ricciardo during a previous visit to Vegas – is equally excited to hit the track for the first time.\nWhen asked how it felt to visit the city in a professional capacity rather than purely for fun, the Ferrari driver explained: 'It feels very different for now – last time I came here was to party. This weekend there are no parties planned, maybe Saturday night if there is a win, but only if there is a win! Until Saturday we'll have to work hard to get that.\n'I love street tracks so first of all I cannot wait to be out on track tomorrow and to try this new street track. I've had quite a few laps on the simulator, but the amount of data are limited for now because we haven't done any real laps yet, but the ones I did virtually I enjoyed.'\nThe Las Vegas Grand Prix will be a third home race of the season for Williams' Logan Sargeant, and the rookie driver is looking forward to returning to a city that he previously enjoyed racing in during his karting days.\nThis feature is currently not available because you need to provide consent to functional cookies. Please update your cookie preferences\nLogan Sargeant: Driving on the strip in Vegas will be 'super-special'\n'I am [excited], for sure,' said Sargeant. 'I think all three of these US Grands Prix have been super special in their own way: obviously Miami being on my doorstep; Austin I feel like is always one of the best energies and atmospheres that we experience all season; and who can say they've driven an F1 car down the strip in Vegas?\n'It's going to be cool. I raced here so many times in the past in karting and it was always my favourite race of the year, so coming back to do it in F1, hopefully we can make it a good one.'\nWhile Kevin Magnussen admitted that the change in timings – with sessions running late at night before the Grand Prix takes place on Saturday evening – has been 'strange' so far, the Dane added: 'I'm sure it's going to be an exciting race and a spectacular event.'\nThe spectacle so far has also impressed Valtteri Bottas. When quizzed on whether he had ever experienced a similar kind of build-up to an F1 race during his extensive career, the Alfa Romeo driver responded: 'No I haven't. It's been quite spectacular, lots of hype, which is for a reason. It's a pretty unique place for a Grand Prix and they've done a great job. Everything here looks great and everything is ready.'",
        "word_count": 695,
        "is_opinion": false,
        "twitter_account": "@f1",
        "all_links": [],
        "all_domain_links": [],
        "id": "496df2f35877ee4a306449a636cd0db3",
        "score": 12.168539
    }
]